ednieuw/Arduino-ESP32-Nano-Wordclock/Old/ESP32_WordClockV178/ESP32_WordClockV178.ino
// -----------------------------------------------------------------------------
// Client callbacks
// -----------------------------------------------------------------------------
class TimeSenderClientCB : public NimBLEClientCallbacks
{
 void onConnect(NimBLEClient* client) override
   {
    TSConnected = true;
    TSConnecting = false;
    BLEConnectedSince = millis();
    Tekstprintln("TimeSender connected");
   }

 void onDisconnect(NimBLEClient* client, int reason) override
   {
    Tekstprintlnf("TimeSender disconnected (reason: %d)", reason);
    
    TSConnected = false;
    TSConnecting = false;
    TShaveFoundAddr = false;
    TSconnectRequested = false;
    TimeSenderRunning = false;  // Reset flag
    
    // Clean up client
    if (pClient)
    {
      NimBLEDevice::deleteClient(pClient);
      pClient = nullptr;
    }
    pRemoteTX = nullptr;
    pRemoteRX = nullptr;
    
    // Stop any existing scan first
    NimBLEScan* scan = NimBLEDevice::getScan();
    if (scan->isScanning())
    {
      scan->stop();
      delay(100);
    }
    
    // Start new scan
    delay(200);
    StartTimeSenderScan();
   }
};



//--------------------------------------------
// Scan callbacks
//--------------------------------------------
class TimeSenderScanCB : public NimBLEScanCallbacks
{
 void onResult(const NimBLEAdvertisedDevice* dev) override
   {
    if (TSConnecting) return;
    if (!dev->haveName()) return;
    std::string rawName = dev->getName();
    if (rawName.find(TIMESENDER_DEVICE_NAME) == std::string::npos) return;
    if (dev->getRSSI() <= TIMESENDER_MIN_RSSI) return;
    if (!dev->isConnectable()) return;
    if (!dev->isAdvertisingService(NimBLEUUID(SERVICE_UUID))) return;
    TSfoundAddr        = dev->getAddress();
    TShaveFoundAddr    = true;
    TSconnectRequested = true;
    NimBLEDevice::getScan()->stop();
   }
};

//--------------------------------------------                                                //
// BLE TimeSender Start Time Sender scan
//--------------------------------------------
void StartTimeSenderScan(void)
{
  NimBLEScan* scan = NimBLEDevice::getScan();
 if (TimeSenderRunning && !scan->isScanning())                                               // Reset flag if scan isn't actually running
  {
    TimeSenderRunning = false;
    Tekstprintln("Flag reset - scan not running");
  }
  
  // Only start if not already running
  if (TimeSenderRunning) 
  {
    Tekstprintln("Scan already running - skipping");
    return;
  }
  
  // Stop any existing scan
  if (scan->isScanning())
  {
    scan->stop();
    delay(100);
  }
  
  TimeSenderRunning = true;
  
  scan->setActiveScan(true);
  scan->setInterval(160);
  scan->setWindow(30);
  scan->setScanCallbacks(new TimeSenderScanCB(), true);  // true = delete old callback
  
  if (!scan->start(0, false, false))
  {
    Tekstprintln("ERROR: Failed to start TimeSender scan");
    TimeSenderRunning = false;
  }
  else
  {
    lastTimeSenderScan = millis();
    Tekstprintln("TimeSender scan started");
  }
}
//--------------------------------------------                                                //
// BLE TimeSender Stop Time Sender
//--------------------------------------------
void StopTimeSender()
{
 NimBLEDevice::getScan()->stop();
 if (TSConnected) pClient->disconnect();
 TSConnected = false;
 TSConnecting          = false;
 pRemoteTX           = nullptr;
 pRemoteRX           = nullptr;
 pClient             = nullptr;
 TShaveFoundAddr       = false;
 TSconnectRequested    = false;
}

//--------------------------------------------                                                //
// BLE TimeSender Connect TimeSender
// -------------------------------------------
static void Connect_TimeSender(void)
{
 if (!TShaveFoundAddr || TSConnected || TSConnecting) return;
 const int MAX_CONNECT_ATTEMPTS = 3;
 const unsigned long POST_DISCONNECT_DELAY_MS = 150;
 
 for (int attempt = 1; attempt <= MAX_CONNECT_ATTEMPTS; ++attempt)
    {
     NimBLEDevice::getScan()->stop();
     delay(100);
     pClient = NimBLEDevice::createClient();
     pClient->setClientCallbacks(new TimeSenderClientCB(), false);
     TSConnecting      = true;
     TSconnectStartms  = millis();
     
     if (!pClient->connect(TSfoundAddr))
        {
         NimBLEDevice::deleteClient(pClient);
         pClient = nullptr;
         TSConnecting = false;
         delay(POST_DISCONNECT_DELAY_MS);
         continue;
        }
       
      NimBLERemoteService* svc = pClient->getService(SERVICE_UUID);
      if (!svc)
        {
         pClient->disconnect();
         NimBLEDevice::deleteClient(pClient);
         pClient = nullptr;
         TSConnecting = false;
         delay(POST_DISCONNECT_DELAY_MS);
         continue;
        }
      
      pRemoteTX = svc->getCharacteristic(CHARACTERISTIC_UUID_TX);
      pRemoteRX = svc->getCharacteristic(CHARACTERISTIC_UUID_RX);
      if (!pRemoteTX || !pRemoteRX)
        {
         pClient->disconnect();
         NimBLEDevice::deleteClient(pClient);
         pClient = nullptr;
         TSConnecting = false;
         delay(POST_DISCONNECT_DELAY_MS);
         continue;
        }
      
      if (!pRemoteTX->subscribe(true, TimeSenderNotifyCB, true))
        {
         pClient->disconnect();
         NimBLEDevice::deleteClient(pClient);
         pClient = nullptr;
         TSConnecting = false;
         delay(POST_DISCONNECT_DELAY_MS);
         continue;
        }
      
      BLEConnectedSince = millis();
      TShaveFoundAddr     = false;
      TSconnectRequested  = false;
      TSConnecting        = false;
//      Tekstprintln("TimeSender connected");
      return;
    }

 if (pClient)
   {
    NimBLEDevice::deleteClient(pClient);
    pClient = nullptr;
   }
 TShaveFoundAddr    = false;
 TSconnectRequested = false;
 Tekstprintln("TimeSender connection failed - restarting scan");
 NimBLEDevice::getScan()->start(0, false, false);
}


//--------------------------------------------                                                //
// BLE TimeSender Check TimeSender Client
//--------------------------------------------
void CheckTimeSenderClient(void)
{
  unsigned long now = millis();
  NimBLEScan* scan = NimBLEDevice::getScan();
  
  // If scanning is not active and flag is still true, reset it to allow rescanning
  if (!scan->isScanning() && TimeSenderRunning)
  {
    TimeSenderRunning = false;  // Allow rescanning
    Tekstprintln("TimeSenderRunning flag reset - ready for rescan");
  }
  
